# File          : wds-emacs-execrices.el
# Created       : Sun 24 Apr 2016 14:02:12
# Last Modified : <2016-11-14 Mon 22:13:37 GMT> sharlatan
# Authour       : sharlatan
# Maintainer(s) :

#+OPTIONS: num:nil

#+TITLE: Emacs exercies
*** Examples
#+NAME: e-1.1
#+BEGIN_SRC emacs-lisp
(+ 2 2)
#+END_SRC

#+RESULTS: e-1.1
: 4

#+NAME: e-1.2
#+BEGIN_SRC emacs-lisp
(+)
(*)
#+END_SRC

#+RESULTS: e-1.2
: 1

#+NAME: e-1.3
#+BEGIN_SRC emacs-lisp
(zerop 0)
#+END_SRC

#+RESULTS: e-1.3
: t

*** 1.11 Exercises
Generate an error message by evaluating an appropriate symbol that is
not within parentheses.
#+NAME: ex-1.11.1
#+BEGIN_SRC emacs-lisp
hello-world!
#+END_SRC

Generate an error message by evaluating an appropriate symbol that is
between parentheses.
#+NAME: ex-1.11.2
#+BEGIN_SRC emacs-lisp
(hello-world!)
#+END_SRC

Create a counter that increments by two rather than one.
#+NAME: ex-1.11.3
#+BEGIN_SRC emacs-lisp
(setq counter 0)
(setq counter (+ 2 counter))
counter
#+END_SRC

#+RESULTS: ex-1.11.3
: 2

Write an expression that prints a message in the echo area when
evaluated.
#+NAME: ex-1.11.4
#+BEGIN_SRC emacs-lisp
(message "Try this massage!")
#+END_SRC

#+RESULTS: e-1.4
: Try this massage!


*** 2.6 Exercies

Find a file with which you are working and move towards its middle.
Find its buffer name, file name, length, and your position in the file.

#+NAME: move to midle of file
#+BEGIN_SRC emacs-lisp
(goto-char
 (/ (point-max) 2))
#+END_SRC

#+RESULTS: move
: 2475

#+NAME: return list with buffer name, file name, length and position
#+BEGIN_SRC emacs-lisp
(list
 (buffer-name)
 (buffer-file-name)
 (point-max)
 (point))
#+END_SRC

#+RESULTS: return




*** 7.7 Ex
1. Construct a list of four birds by evaluating several expressions with ‘cons’.
   #+NAME: ex07-ls01
   #+BEGIN_SRC emacs-lisp :exports both
     ;; Birds in Russian translit constructed with multiple 'cons'.
     (setq ptichki (cons 'snigir
                         (cons 'ivolga
                               (cons 'djatel '(chajka)))))
   #+END_SRC

   #+RESULTS: ex07-ls01
   | snigir | ivolga | djatel | chajka |

2. Find out what happens when you ‘cons’ a list onto itself.
   #+NAME: ex07-ls02
   #+BEGIN_SRC emacs-lisp :exports both :var ptichki=ex07-ls01
     (cons ptichki ptichki)
   #+END_SRC

   #+RESULTS: ex07-ls02
   | (snigir ivolga djatel chajka) | snigir | ivolga | djatel | chajka |

3. Replace the first element of the list of four birds with a fish.
   #+NAME: ex07-ls03
   #+BEGIN_SRC emacs-lisp :exports both :var ptichki=ex07-ls01
     (setcar ptichki 'kambala)
     ptichki
   #+END_SRC

   #+RESULTS: ex07-ls03
   | kambala | ivolga | djatel | chajka |

4. Replace the rest  of that list with a list of other fish.
   #+NAME: ex07-ls04
   #+BEGIN_SRC emacs-lisp :exports both :var ptichki=ex07-ls03
     (setcdr ptichki '(tolsolobik farel karp))
     ptichki
   #+END_SRC

   #+RESULTS: ex07-ls04
   | kambala | tolsolobik | farel | karp |

